## **Understand the data**
____

In [1]:
import pandas as pd

In [6]:
df = pd.read_csv('aug_train.csv')

## **How big is the data?**

In [7]:
df.shape

(19158, 14)

## **How does the data look?**

In [8]:
df.sample(5)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
15432,10106,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Humanities,16,100-500,Pvt Ltd,>4,228,1.0
15079,23109,city_114,0.926,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,1000-4999,Pvt Ltd,1,104,0.0
13888,26671,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,<1,1000-4999,Pvt Ltd,1,32,0.0
17313,17987,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,NaN,NaN,1,45,0.0
16160,21256,city_103,0.920,Male,No relevent experience,Full time course,Graduate,STEM,2,NaN,NaN,never,48,1.0

## **What is the data type of cols?**

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

## **Is there a missing values?**

In [10]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

## **How does the data look mathematically?**

In [11]:
df.describe()

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

## **Are there duplicate values?**

In [13]:
df.duplicated().sum()

0

## **How is the correlation between cols?**

In [14]:
df.corr()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_7892\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,enrollee_id,city_development_index,training_hours,target
enrollee_id,1.000000,-0.040455,0.000998,0.049475
city_development_index,-0.040455,1.000000,0.001920,-0.341665
training_hours,0.000998,0.001920,1.000000,-0.021577
target,0.049475,-0.341665,-0.021577,1.000000